export const locations = {
    getOps() {
        return  [
            { name: 'Новомет-Пермь' },
            { name: 'Новомет-Ноябрьск' },
            { name: 'Новомет-Нефтеюганск' },
            { name: 'Новомет-Нижневартовск' },
            { name: 'Новомет-Стрежевой' },
            { name: 'Новомет-Юг' },
            { name: 'Новомет-Казахстан' },
            { name: 'Новомет-Азербайджан' },
        ]
    },

    getCities() {
        return [
            { name: 'Пермь' },
            { name: 'Ноябрьск' },
            { name: 'Нефтеюганск' },
            { name: 'Нижневартовск' },
            { name: 'Стрежевой' },
            { name: 'Юг' },
            { name: 'Казахстан' },
            { name: 'Азербайджан' },
        ];
    },

    getCompanies() {
        return [
            { name: 'Лукойл' },
            { name: 'МНКТ' },
            { name: 'Новомет' },
            { name: 'Сургут' },
            { name: 'АО «Томскнефть» ВНК' },
        ];
    },

    getFields() {
        return [
            { name: 'Акшабулак' },
            { name: 'Арыскум' },
            { name: 'Вахское' },
            { name: 'Висовое' },
            { name: 'Волковское' },
            { name: 'Западно-Катыльгинское' },
            { name: 'Катыльгинское' },
            { name: 'Кошильское' },
            { name: 'Колотушное' },
            { name: 'Кумколь' },
            { name: 'Ломовое' },
            { name: 'Малореченское' },
            { name: 'Новое' },
            { name: 'Озерное' },
            { name: 'Оленье' },
            { name: 'Первомайское' },
            { name: 'Полуденное' },
            { name: 'Приграничное' },
            { name: 'Проточное' },
            { name: 'Прованьское' },
            { name: 'Северное' },
            { name: 'Старое' },
            { name: 'Советское' },
            { name: 'Средиземное' },
            { name: 'Тестовое' },
            { name: 'Трайгородско-Кондаковское' },
            { name: 'Тусколье' },
            { name: 'Уньвинское' },
            { name: 'Хаиркельды' },
            { name: 'Чкаловское' },
            { name: 'Южно-Приобское' },
            { name: 'Южно-Черемшанское' },
            { name: 'Ярактинское '}
        ];
    },

    getStopReasons() {
        return [
            { name: 'ГТМ' },
            { name: 'Извлечение' },
            { name: 'Клин' },
            { name: 'Нет подачи' },
            { name: 'Нет притока' },
            { name: 'Отсутствуют' },
            { name: 'Перевод в ППД' },
            { name: 'Полёт' },
            { name: 'ППР, оптимизация' },
            { name: 'Прочее' },
            { name: 'Смена УЭЦН' },
            { name: 'Снижение производительности' },
            { name: 'R-0' },
        ];
    },

    getModes() {
        return [
            { name: 'Постоянный' },
            { name: 'Периодический' },
            { name: 'Нет данных' },
        ];
    },
};
